PontusO/iLabs_nRF52_Arduino/boards.txt
menu.softdevice=SoftDevice
menu.debug=Debug
menu.debug_output=Debug Output
menu.external_mem_size=External FLASH Memory


# -------------------------------------------------------
# Boards that aren't made by Adafruit
# and are not officially supported
# -------------------------------------------------------

# -----------------------------------
# Nordic nRF52840 DK
# -----------------------------------
pca10056.name=Nordic nRF52840 DK

# VID/PID for Bootloader, Arduino & CircuitPython
pca10056.vid.0=0x239A
pca10056.pid.0=0x8029
pca10056.vid.1=0x239A
pca10056.pid.1=0x0029

# Upload
pca10056.bootloader.tool=bootburn
pca10056.upload.tool=nrfutil
pca10056.upload.protocol=nrfutil
pca10056.upload.use_1200bps_touch=true
pca10056.upload.wait_for_upload_port=true
pca10056.upload.maximum_size=815104
pca10056.upload.maximum_data_size=237568

# Build
pca10056.build.mcu=cortex-m4
pca10056.build.f_cpu=64000000
pca10056.build.board=NRF52840_PCA10056
pca10056.build.core=nRF5
pca10056.build.variant=pca10056
pca10056.build.usb_manufacturer="Nordic"
pca10056.build.usb_product="nRF52840 DK"
pca10056.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
pca10056.build.ldscript=nrf52840_s140_v6.ld
pca10056.build.openocdscript=scripts/openocd/daplink_nrf52.cfg
pca10056.build.vid=0x239A
pca10056.build.pid=0x8029
pca10056.build.uf2_family=0xADA52840

# Menu: SoftDevice
pca10056.menu.softdevice.s140v6=S140 6.1.1
pca10056.menu.softdevice.s140v6.build.sd_name=s140
pca10056.menu.softdevice.s140v6.build.sd_version=6.1.1
pca10056.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Menu: Debug Level
pca10056.menu.debug.l0=Level 0 (Release)
pca10056.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
pca10056.menu.debug.l1=Level 1 (Error Message)
pca10056.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
pca10056.menu.debug.l2=Level 2 (Full Debug)
pca10056.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
pca10056.menu.debug.l3=Level 3 (Segger SystemView)
pca10056.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
pca10056.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# Menu: Debug Port
pca10056.menu.debug_output.serial=Serial
pca10056.menu.debug_output.serial.build.logger_flags=-DCFG_LOGGER=0
pca10056.menu.debug_output.serial1=Serial1
pca10056.menu.debug_output.serial1.build.logger_flags=-DCFG_LOGGER=1 -DCFG_TUSB_DEBUG=CFG_DEBUG
pca10056.menu.debug_output.rtt=Segger RTT
pca10056.menu.debug_output.rtt.build.logger_flags=-DCFG_LOGGER=2 -DCFG_TUSB_DEBUG=CFG_DEBUG -DSEGGER_RTT_MODE_DEFAULT=SEGGER_RTT_MODE_BLOCK_IF_FIFO_FULL

# External memory size

# -----------------------------------
# Particle Xenon
# -----------------------------------
particle_xenon.name=Particle Xenon

# VID/PID for Bootloader, Arduino & CircuitPython
particle_xenon.vid.0=0x239A
particle_xenon.pid.0=0x8029
particle_xenon.vid.1=0x239A
particle_xenon.pid.1=0x0029

# Upload
particle_xenon.bootloader.tool=bootburn
particle_xenon.upload.tool=nrfutil
particle_xenon.upload.protocol=nrfutil
particle_xenon.upload.use_1200bps_touch=true
particle_xenon.upload.wait_for_upload_port=true
particle_xenon.upload.maximum_size=815104
particle_xenon.upload.maximum_data_size=237568

# Build
particle_xenon.build.mcu=cortex-m4
particle_xenon.build.f_cpu=64000000
particle_xenon.build.board=PARTICLE_XENON
particle_xenon.build.core=nRF5
particle_xenon.build.variant=particle_xenon
particle_xenon.build.usb_manufacturer="Particle"
particle_xenon.build.usb_product="Xenon"
particle_xenon.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
particle_xenon.build.ldscript=nrf52840_s140_v6.ld
particle_xenon.build.openocdscript=scripts/openocd/daplink_nrf52.cfg
particle_xenon.build.vid=0x239A
particle_xenon.build.pid=0x8029
particle_xenon.build.uf2_family=0xADA52840

# Menu: SoftDevice
particle_xenon.menu.softdevice.s140v6=S140 6.1.1
particle_xenon.menu.softdevice.s140v6.build.sd_name=s140
particle_xenon.menu.softdevice.s140v6.build.sd_version=6.1.1
particle_xenon.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Menu: Debug Level
particle_xenon.menu.debug.l0=Level 0 (Release)
particle_xenon.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
particle_xenon.menu.debug.l1=Level 1 (Error Message)
particle_xenon.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
particle_xenon.menu.debug.l2=Level 2 (Full Debug)
particle_xenon.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
particle_xenon.menu.debug.l3=Level 3 (Segger SystemView)
particle_xenon.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
particle_xenon.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# Menu: Debug Port
particle_xenon.menu.debug_output.serial=Serial
particle_xenon.menu.debug_output.serial.build.logger_flags=-DCFG_LOGGER=0
particle_xenon.menu.debug_output.serial1=Serial1
particle_xenon.menu.debug_output.serial1.build.logger_flags=-DCFG_LOGGER=1 -DCFG_TUSB_DEBUG=CFG_DEBUG
particle_xenon.menu.debug_output.rtt=Segger RTT
particle_xenon.menu.debug_output.rtt.build.logger_flags=-DCFG_LOGGER=2 -DCFG_TUSB_DEBUG=CFG_DEBUG -DSEGGER_RTT_MODE_DEFAULT=SEGGER_RTT_MODE_BLOCK_IF_FIFO_FULL

# External memory size

# -----------------------------------
# iLabs Challenger 840 BLE
# -----------------------------------
challenger_840_ble.name=iLabs Challenger 840 BLE

# VID/PID for Bootloader, Arduino & CircuitPython
challenger_840_ble.vid.0=0x1209
challenger_840_ble.pid.0=0x7380
challenger_840_ble.vid.1=0x1209
challenger_840_ble.pid.1=0x7381

# Upload
challenger_840_ble.bootloader.tool=bootburn
challenger_840_ble.upload.tool=nrfutil
challenger_840_ble.upload.protocol=nrfutil
challenger_840_ble.upload.use_1200bps_touch=true
challenger_840_ble.upload.wait_for_upload_port=true
challenger_840_ble.upload.maximum_size=786432
challenger_840_ble.upload.maximum_data_size=237568

# Build
challenger_840_ble.build.mcu=cortex-m4
challenger_840_ble.build.f_cpu=64000000
challenger_840_ble.build.board=CHALLENGER_840_BLE
challenger_840_ble.build.core=nRF5
challenger_840_ble.build.variant=challenger_840_ble
challenger_840_ble.build.usb_manufacturer="iLabs"
challenger_840_ble.build.usb_product="Challenger 840 BLE"
challenger_840_ble.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
challenger_840_ble.build.ldscript=nrf52840_s140_v6_qspi_bl.ld
challenger_840_ble.build.openocdscript=scripts/openocd/daplink_nrf52.cfg
challenger_840_ble.build.vid=0x1209
challenger_840_ble.build.pid=0x7380
challenger_840_ble.build.uf2_family=0xADA52840

# Menu: SoftDevice
challenger_840_ble.menu.softdevice.s140v6=S140 6.1.1
challenger_840_ble.menu.softdevice.s140v6.build.sd_name=s140
challenger_840_ble.menu.softdevice.s140v6.build.sd_version=6.1.1
challenger_840_ble.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Menu: Debug Level
challenger_840_ble.menu.debug.l0=Level 0 (Release)
challenger_840_ble.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
challenger_840_ble.menu.debug.l1=Level 1 (Error Message)
challenger_840_ble.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
challenger_840_ble.menu.debug.l2=Level 2 (Full Debug)
challenger_840_ble.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
challenger_840_ble.menu.debug.l3=Level 3 (Segger SystemView)
challenger_840_ble.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
challenger_840_ble.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# Menu: Debug Port
challenger_840_ble.menu.debug_output.serial=Serial
challenger_840_ble.menu.debug_output.serial.build.logger_flags=-DCFG_LOGGER=0
challenger_840_ble.menu.debug_output.serial1=Serial1
challenger_840_ble.menu.debug_output.serial1.build.logger_flags=-DCFG_LOGGER=1 -DCFG_TUSB_DEBUG=CFG_DEBUG
challenger_840_ble.menu.debug_output.rtt=Segger RTT
challenger_840_ble.menu.debug_output.rtt.build.logger_flags=-DCFG_LOGGER=2 -DCFG_TUSB_DEBUG=CFG_DEBUG -DSEGGER_RTT_MODE_DEFAULT=SEGGER_RTT_MODE_BLOCK_IF_FIFO_FULL

# External memory size
challenger_840_ble.menu.external_mem_size.0MB=0MB (None)
challenger_840_ble.menu.external_mem_size.0MB.build.ext_mem_flags=-DEXTERNAL_FLASH_DEVICES=None
challenger_840_ble.menu.external_mem_size.2MB=2MB (W25Q16FW)
challenger_840_ble.menu.external_mem_size.2MB.build.ext_mem_flags=-DEXTERNAL_FLASH_DEVICES=W25Q16FW
challenger_840_ble.menu.external_mem_size.4MB=4MB (W25Q32FV)
challenger_840_ble.menu.external_mem_size.4MB.build.ext_mem_flags=-DEXTERNAL_FLASH_DEVICES=W25Q32FV
challenger_840_ble.menu.external_mem_size.8MB=8MB (W25Q64JV_IM)
challenger_840_ble.menu.external_mem_size.8MB.build.ext_mem_flags=-DEXTERNAL_FLASH_DEVICES=W25Q64JV_IM

# -----------------------------------
# iLabs Connectivity 840
# -----------------------------------
connectivity_840.name=iLabs Connectivity 840

# VID/PID for Bootloader, Arduino & CircuitPython
connectivity_840.vid.0=0x1209
connectivity_840.pid.0=0x7384
connectivity_840.vid.1=0x1209
connectivity_840.pid.1=0x7385

# Upload
connectivity_840.bootloader.tool=bootburn
connectivity_840.upload.tool=nrfutil
connectivity_840.upload.protocol=nrfutil
connectivity_840.upload.use_1200bps_touch=true
connectivity_840.upload.wait_for_upload_port=true
connectivity_840.upload.maximum_size=786432
connectivity_840.upload.maximum_data_size=237568

# Build
connectivity_840.build.mcu=cortex-m4
connectivity_840.build.f_cpu=64000000
connectivity_840.build.board=CONNECTIVITY_840
connectivity_840.build.core=nRF5
connectivity_840.build.variant=connectivity_840
connectivity_840.build.usb_manufacturer="iLabs"
connectivity_840.build.usb_product="Connectivity 840"
connectivity_840.build.extra_flags=-DNRF52840_XXAA {build.flags.usb}
connectivity_840.build.ldscript=nrf52840_s140_v6_qspi_bl.ld
connectivity_840.build.openocdscript=scripts/openocd/daplink_nrf52.cfg
connectivity_840.build.vid=0x1209
connectivity_840.build.pid=0x7384
connectivity_840.build.uf2_family=0xADA52840

# Menu: SoftDevice
connectivity_840.menu.softdevice.s140v6=S140 6.1.1
connectivity_840.menu.softdevice.s140v6.build.sd_name=s140
connectivity_840.menu.softdevice.s140v6.build.sd_version=6.1.1
connectivity_840.menu.softdevice.s140v6.build.sd_fwid=0x00B6

# Menu: Debug Level
connectivity_840.menu.debug.l0=Level 0 (Release)
connectivity_840.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
connectivity_840.menu.debug.l1=Level 1 (Error Message)
connectivity_840.menu.debug.l1.build.debug_flags=-DCFG_DEBUG=1
connectivity_840.menu.debug.l2=Level 2 (Full Debug)
connectivity_840.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
connectivity_840.menu.debug.l3=Level 3 (Segger SystemView)
connectivity_840.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
connectivity_840.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

# Menu: Debug Port
connectivity_840.menu.debug_output.serial=Serial
connectivity_840.menu.debug_output.serial.build.logger_flags=-DCFG_LOGGER=0
connectivity_840.menu.debug_output.serial1=Serial1
connectivity_840.menu.debug_output.serial1.build.logger_flags=-DCFG_LOGGER=1 -DCFG_TUSB_DEBUG=CFG_DEBUG
connectivity_840.menu.debug_output.rtt=Segger RTT
connectivity_840.menu.debug_output.rtt.build.logger_flags=-DCFG_LOGGER=2 -DCFG_TUSB_DEBUG=CFG_DEBUG -DSEGGER_RTT_MODE_DEFAULT=SEGGER_RTT_MODE_BLOCK_IF_FIFO_FULL

# External memory size
connectivity_840.menu.external_mem_size.0MB=0MB (None)
connectivity_840.menu.external_mem_size.0MB.build.ext_mem_flags=-DEXTERNAL_FLASH_DEVICES=None
connectivity_840.menu.external_mem_size.6MB=6MB (W25Q64JV_IM, 2MB reserved for FOTA bootloader)
connectivity_840.menu.external_mem_size.6MB.build.ext_mem_flags=-DEXTERNAL_FLASH_DEVICES=W25Q64JV_IM -DILABS_QSPI_USER_BYTES=0x600000
connectivity_840.menu.external_mem_size.8MB=8MB (W25Q64JV_IM, no FOTA reservation)
connectivity_840.menu.external_mem_size.8MB.build.ext_mem_flags=-DEXTERNAL_FLASH_DEVICES=W25Q64JV_IM -DILABS_QSPI_USER_BYTES=0x800000
